# PathReinEndSpanhookPrim Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PathReinEndSpanhookPrim Property
ParameterTypeId Class See Also
---
"End Hook Angle Primary"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PathReinEndSpanhookPrim { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathReinEndSpanhookPrim As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PathReinEndSpanhookPrim {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace